Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 10, 1, 1)
  (1): ConvTranspose2d(10, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 2, 1, 1)
  (1): ConvTranspose2d(2, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 3, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
Sequential(
  (0): View(-1, 2, 1, 1)
  (1): ConvTranspose2d(2, 128, kernel_size=(4, 4), stride=(1, 1))
  (2): ReLU()
  (3): ConvTranspose2d(128, 64, kernel_size=(6, 6), stride=(1, 1))
  (4): ReLU()
  (5): ConvTranspose2d(64, 32, kernel_size=(6, 6), stride=(2, 2))
  (6): ReLU()
  (7): ConvTranspose2d(32, 1, kernel_size=(7, 7), stride=(1, 1))
  (8): Sigmoid()
)
